<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Practice Notebook: Data Wrangling with Python - Data Exploration

## 2. Data Exploration

#### <font color="blue">Pre-requisites</font>

In [0]:
# Pre-requisite 1
# ---
# Importing pandas library
# This will be the library that will help us explore our dataset
# ---
# OUR CODE GOES BELOW
# 
import pandas as pd

In [0]:
# Pre-requisite 2
# ---
# Reading our dataset from the url
# ---
df = pd.read_csv('http://bit.ly/IrisDataset')

#### <font color="blue">Examples</font>

##### <font color="blue">Example 1</font>

In [5]:
# Example 1
# ---
# Determining the no. of records in the iris dataset above
# NB: We will use the above loaded dataset
# ---
# OUR CODE GOES BELOW
#

# Shape returns no. or records/instances (left) and columns/variables (right)
#
df.shape

(150, 5)

##### <font color="blue">Example 2</font>

In [6]:
# Example 2
# ---
# Previewing the first few records/instances of df
# NB: head() will give us the first five records/instances
# ---
# OUR CODE GOES BELOW
# 
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

##### <font color="blue">Example 3</font>

In [7]:
# Example 3
# ---
# Previewing the last few records/instances of our dataset
# NB: tail() gives us the last 5 records/instances
# ---
# OUR CODE GOES BELOW
#
df.tail()

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

##### <font color="blue">Example 4</font>

In [8]:
# Example 4
# ---
# Checking the datatypes of df variables (columns)
# ---
# OUR CODE GOES BELOW
#
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

#### <font color="green">Challenges</font>

In [0]:
# Pre-requisite
# ---
# Load our cities dataset below
# ---
# Dataset url = Dataset url = http://bit.ly/CitiesDataset1
# Hint: Load from local file
# ---
# OUR CODE GOES BELOW
# 
city = pd.read_csv('http://bit.ly/CitiesDataset1')

##### <font color="green">Challenge 1</font>

In [13]:
# Challenge 1
# ---
# Question: Determining the no. of records in the cities dataset
# ---
# 
#OUR CODE GOES HERE
city.shape

(213, 5)

##### <font color="green">Challenge 2</font>

In [14]:
# Challenge 2
# ---
# Question: Preview the first few records of the cities dataset
# ---
# 
#OUR CODE GOES HERE
city.head(5)

       city         country  latitude  longitude  temperature
0   Aalborg         Denmark     57.03       9.92         7.52
1  Aberdeen  United Kingdom     57.17      -2.08         8.10
2    Abisko          Sweden     63.35      18.83         0.20
3     Adana          Turkey     36.99      35.32        18.67
4  Albacete           Spain     39.00      -1.87        12.62

##### <font color="green">Challenge 3</font>

In [15]:
# Challenge 3
# ---
# Question: Preview the last few records of the cities dataset
# ---
# 
#OUR CODE GOES HERE
city.tail(10)

            city      country  latitude  longitude  temperature
203       Vienna      Austria     48.20      16.37         7.86
204         Vigo        Spain     42.22      -8.73        12.85
205      Vilnius    Lithuania     54.68      25.32         5.38
206       Warsaw       Poland     52.25      21.00         7.20
207      Wroclaw       Poland     51.11      17.03         7.17
208  Yevpatoriya      Ukraine     45.20      33.36        10.02
209     Zaragoza        Spain     41.65      -0.89        14.17
210     Zhytomyr      Ukraine     50.25      28.66         6.67
211    Zonguldak       Turkey     41.43      31.78        10.64
212       Zurich  Switzerland     47.38       8.56         6.68

##### <font color="green">Challenge 4</font>

In [17]:
# Challenge 4
# ---
# Question: Check the datatypes of the cities dataset
# ---
# 
#OUR CODE GOES HERE
city.dtypes

city            object
country         object
latitude       float64
longitude      float64
temperature    float64
dtype: object